; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/blocksworld/domain.pddl
;;
(define (domain blocksworld)

(:requirements :strips)

(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=17, out_folder=training/easy, instance_id=58, seed=85

(define (problem blocksworld-58)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b11)
    (on-table b11)
    (clear b3)
    (on b3 b9)
    (on b9 b2)
    (on b2 b12)
    (on b12 b5)
    (on b5 b17)
    (on b17 b13)
    (on b13 b10)
    (on b10 b15)
    (on b15 b8)
    (on b8 b14)
    (on b14 b16)
    (on b16 b6)
    (on b6 b4)
    (on b4 b7)
    (on-table b7))
 (:goal  (and 
    (clear b7)
    (on b7 b15)
    (on b15 b5)
    (on b5 b12)
    (on b12 b2)
    (on b2 b14)
    (on b14 b6)
    (on b6 b8)
    (on b8 b17)
    (on b17 b4)
    (on b4 b16)
    (on b16 b11)
    (on b11 b9)
    (on b9 b3)
    (on b3 b10)
    (on b10 b13)
    (on b13 b1)
    (on-table b1))))

; plan
1. (unstack b1 b11)
   deleted: (on b1 b11) (clear b1) (arm-empty)
   added: (holding b1) (clear b11)
   goals met: 0 of 18
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 18
3. (unstack b3 b9)
   deleted: (on b3 b9) (clear b3) (arm-empty)
   added: (holding b3) (clear b9)
   goals met: 1 of 18
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 18
5. (unstack b9 b2)
   deleted: (on b9 b2) (clear b9) (arm-empty)
   added: (holding b9) (clear b2)
   goals met: 1 of 18
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 18
7. (unstack b2 b12)
   deleted: (on b2 b12) (clear b2) (arm-empty)
   added: (holding b2) (clear b12)
   goals met: 1 of 18
8. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 18
9. (unstack b12 b5)
   deleted: (on b12 b5) (clear b12) (arm-empty)
   added: (holding b12) (clear b5)
   goals met: 1 of 18
10. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 18
11. (unstack b5 b17)
   deleted: (on b5 b17) (clear b5) (arm-empty)
   added: (holding b5) (clear b17)
   goals met: 1 of 18
12. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 18
13. (unstack b17 b13)
   deleted: (on b17 b13) (clear b17) (arm-empty)
   added: (holding b17) (clear b13)
   goals met: 1 of 18
14. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 18
15. (unstack b13 b10)
   deleted: (on b13 b10) (clear b13) (arm-empty)
   added: (holding b13) (clear b10)
   goals met: 1 of 18
16. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 18
17. (unstack b10 b15)
   deleted: (on b10 b15) (clear b10) (arm-empty)
   added: (holding b10) (clear b15)
   goals met: 1 of 18
18. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 1 of 18
19. (unstack b15 b8)
   deleted: (on b15 b8) (clear b15) (arm-empty)
   added: (holding b15) (clear b8)
   goals met: 1 of 18
20. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 18
21. (unstack b8 b14)
   deleted: (on b8 b14) (clear b8) (arm-empty)
   added: (holding b8) (clear b14)
   goals met: 1 of 18
22. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 18
23. (unstack b14 b16)
   deleted: (on b14 b16) (clear b14) (arm-empty)
   added: (holding b14) (clear b16)
   goals met: 1 of 18
24. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 18
25. (unstack b16 b6)
   deleted: (on b16 b6) (clear b16) (arm-empty)
   added: (holding b16) (clear b6)
   goals met: 1 of 18
26. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 18
27. (unstack b6 b4)
   deleted: (on b6 b4) (clear b6) (arm-empty)
   added: (holding b6) (clear b4)
   goals met: 1 of 18
28. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 18
29. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 2 of 18
30. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 18
31. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 2 of 18
32. (stack b13 b1)
   deleted: (clear b1) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b1)
   goals met: 3 of 18
33. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 3 of 18
34. (stack b10 b13)
   deleted: (clear b13) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b13)
   goals met: 4 of 18
35. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 4 of 18
36. (stack b3 b10)
   deleted: (clear b10) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b10)
   goals met: 5 of 18
37. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 5 of 18
38. (stack b9 b3)
   deleted: (clear b3) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b3)
   goals met: 6 of 18
39. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 6 of 18
40. (stack b11 b9)
   deleted: (clear b9) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b9)
   goals met: 7 of 18
41. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 7 of 18
42. (stack b16 b11)
   deleted: (clear b11) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b11)
   goals met: 8 of 18
43. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 8 of 18
44. (stack b4 b16)
   deleted: (clear b16) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b16)
   goals met: 9 of 18
45. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 9 of 18
46. (stack b17 b4)
   deleted: (clear b4) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b4)
   goals met: 10 of 18
47. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 10 of 18
48. (stack b8 b17)
   deleted: (clear b17) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b17)
   goals met: 11 of 18
49. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 11 of 18
50. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 12 of 18
51. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 12 of 18
52. (stack b14 b6)
   deleted: (clear b6) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b6)
   goals met: 13 of 18
53. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 13 of 18
54. (stack b2 b14)
   deleted: (clear b14) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b14)
   goals met: 14 of 18
55. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 14 of 18
56. (stack b12 b2)
   deleted: (clear b2) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b2)
   goals met: 15 of 18
57. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 15 of 18
58. (stack b5 b12)
   deleted: (clear b12) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b12)
   goals met: 16 of 18
59. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 16 of 18
60. (stack b15 b5)
   deleted: (clear b5) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b5)
   goals met: 17 of 18
61. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 16 of 18
62. (stack b7 b15)
   deleted: (clear b15) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b15)
   goals met: 18 of 18
